read_verilog src/uart_tx.v
hierarchy -top uart_tx -check
proc; opt
memory; opt
fsm; opt
techmap; opt
dfflibmap -liberty synth_build/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty synth_build/sky130_fd_sc_hd__tt_025C_1v80.lib -script "+strash; dch; map; topo; buffer"
opt_clean
write_verilog synth_build/netlist.v
write_json synth_build/netlist.json
write_blif synth_build/netlist.blif
tee -o synth_build/stats.txt stat -liberty synth_build/sky130_fd_sc_hd__tt_025C_1v80.lib
stat
